test_results/benchmarks/coroutine_perf_20260314_000507.txt
=== SET Operations ===
====== SET ======
  10000 requests completed in 4.02 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 1.015 milliseconds (cumulative count 1)
50.000% <= 4.071 milliseconds (cumulative count 5030)
75.000% <= 4.671 milliseconds (cumulative count 7525)
87.500% <= 5.031 milliseconds (cumulative count 8754)
93.750% <= 5.295 milliseconds (cumulative count 9379)
96.875% <= 5.575 milliseconds (cumulative count 9705)
98.438% <= 5.767 milliseconds (cumulative count 9846)
99.219% <= 5.879 milliseconds (cumulative count 9923)
99.609% <= 6.159 milliseconds (cumulative count 9968)
99.805% <= 6.663 milliseconds (cumulative count 9982)
99.902% <= 8.319 milliseconds (cumulative count 9991)
99.951% <= 9.967 milliseconds (cumulative count 9996)
99.976% <= 10.703 milliseconds (cumulative count 9998)
99.988% <= 10.823 milliseconds (cumulative count 9999)
99.994% <= 11.287 milliseconds (cumulative count 10000)
100.000% <= 11.287 milliseconds (cumulative count 10000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.030% <= 1.103 milliseconds (cumulative count 3)
0.070% <= 1.207 milliseconds (cumulative count 7)
0.140% <= 1.303 milliseconds (cumulative count 14)
0.180% <= 1.407 milliseconds (cumulative count 18)
0.300% <= 1.503 milliseconds (cumulative count 30)
0.470% <= 1.607 milliseconds (cumulative count 47)
0.620% <= 1.703 milliseconds (cumulative count 62)
0.900% <= 1.807 milliseconds (cumulative count 90)
1.270% <= 1.903 milliseconds (cumulative count 127)
2.080% <= 2.007 milliseconds (cumulative count 208)
2.580% <= 2.103 milliseconds (cumulative count 258)
18.220% <= 3.103 milliseconds (cumulative count 1822)
51.520% <= 4.103 milliseconds (cumulative count 5152)
89.440% <= 5.103 milliseconds (cumulative count 8944)
99.590% <= 6.103 milliseconds (cumulative count 9959)
99.900% <= 7.103 milliseconds (cumulative count 9990)
99.930% <= 9.103 milliseconds (cumulative count 9993)
99.960% <= 10.103 milliseconds (cumulative count 9996)
99.990% <= 11.103 milliseconds (cumulative count 9999)
100.000% <= 12.103 milliseconds (cumulative count 10000)

Summary:
  throughput summary: 2486.33 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        3.986     1.008     4.071     5.343     5.831    11.287

=== GET Operations ===
====== GET ======
  10000 requests completed in 4.10 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 1.199 milliseconds (cumulative count 1)
50.000% <= 4.135 milliseconds (cumulative count 5005)
75.000% <= 4.687 milliseconds (cumulative count 7510)
87.500% <= 5.055 milliseconds (cumulative count 8768)
93.750% <= 5.327 milliseconds (cumulative count 9381)
96.875% <= 5.623 milliseconds (cumulative count 9694)
98.438% <= 5.719 milliseconds (cumulative count 9851)
99.219% <= 5.895 milliseconds (cumulative count 9924)
99.609% <= 6.303 milliseconds (cumulative count 9961)
99.805% <= 6.447 milliseconds (cumulative count 9983)
99.902% <= 7.255 milliseconds (cumulative count 9991)
99.951% <= 9.567 milliseconds (cumulative count 9996)
99.976% <= 10.559 milliseconds (cumulative count 9998)
99.988% <= 10.943 milliseconds (cumulative count 9999)
99.994% <= 11.343 milliseconds (cumulative count 10000)
100.000% <= 11.343 milliseconds (cumulative count 10000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.010% <= 1.207 milliseconds (cumulative count 1)
0.090% <= 1.407 milliseconds (cumulative count 9)
0.150% <= 1.503 milliseconds (cumulative count 15)
0.230% <= 1.607 milliseconds (cumulative count 23)
0.340% <= 1.703 milliseconds (cumulative count 34)
0.550% <= 1.807 milliseconds (cumulative count 55)
0.840% <= 1.903 milliseconds (cumulative count 84)
1.370% <= 2.007 milliseconds (cumulative count 137)
1.720% <= 2.103 milliseconds (cumulative count 172)
15.140% <= 3.103 milliseconds (cumulative count 1514)
48.590% <= 4.103 milliseconds (cumulative count 4859)
89.260% <= 5.103 milliseconds (cumulative count 8926)
99.560% <= 6.103 milliseconds (cumulative count 9956)
99.850% <= 7.103 milliseconds (cumulative count 9985)
99.920% <= 8.103 milliseconds (cumulative count 9992)
99.940% <= 9.103 milliseconds (cumulative count 9994)
99.970% <= 10.103 milliseconds (cumulative count 9997)
99.990% <= 11.103 milliseconds (cumulative count 9999)
100.000% <= 12.103 milliseconds (cumulative count 10000)

Summary:
  throughput summary: 2440.81 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        4.065     1.192     4.135     5.463     5.847    11.343

=== Mixed Operations ===
====== SET ======
  10000 requests completed in 4.10 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.895 milliseconds (cumulative count 1)
50.000% <= 4.119 milliseconds (cumulative count 5012)
75.000% <= 4.671 milliseconds (cumulative count 7532)
87.500% <= 5.055 milliseconds (cumulative count 8755)
93.750% <= 5.391 milliseconds (cumulative count 9385)
96.875% <= 5.623 milliseconds (cumulative count 9692)
98.438% <= 5.815 milliseconds (cumulative count 9847)
99.219% <= 5.943 milliseconds (cumulative count 9927)
99.609% <= 6.239 milliseconds (cumulative count 9970)
99.805% <= 6.447 milliseconds (cumulative count 9985)
99.902% <= 7.639 milliseconds (cumulative count 9991)
99.951% <= 9.503 milliseconds (cumulative count 9996)
99.976% <= 10.287 milliseconds (cumulative count 9998)
99.988% <= 10.703 milliseconds (cumulative count 9999)
99.994% <= 11.223 milliseconds (cumulative count 10000)
100.000% <= 11.223 milliseconds (cumulative count 10000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.020% <= 0.903 milliseconds (cumulative count 2)
0.030% <= 1.007 milliseconds (cumulative count 3)
0.050% <= 1.103 milliseconds (cumulative count 5)
0.060% <= 1.207 milliseconds (cumulative count 6)
0.100% <= 1.303 milliseconds (cumulative count 10)
0.130% <= 1.407 milliseconds (cumulative count 13)
0.180% <= 1.503 milliseconds (cumulative count 18)
0.220% <= 1.607 milliseconds (cumulative count 22)
0.370% <= 1.703 milliseconds (cumulative count 37)
0.530% <= 1.807 milliseconds (cumulative count 53)
0.640% <= 1.903 milliseconds (cumulative count 64)
0.840% <= 2.007 milliseconds (cumulative count 84)
1.220% <= 2.103 milliseconds (cumulative count 122)
13.490% <= 3.103 milliseconds (cumulative count 1349)
49.080% <= 4.103 milliseconds (cumulative count 4908)
89.030% <= 5.103 milliseconds (cumulative count 8903)
99.560% <= 6.103 milliseconds (cumulative count 9956)
99.900% <= 7.103 milliseconds (cumulative count 9990)
99.920% <= 8.103 milliseconds (cumulative count 9992)
99.940% <= 9.103 milliseconds (cumulative count 9994)
99.970% <= 10.103 milliseconds (cumulative count 9997)
99.990% <= 11.103 milliseconds (cumulative count 9999)
100.000% <= 12.103 milliseconds (cumulative count 10000)

Summary:
  throughput summary: 2436.65 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        4.073     0.888     4.119     5.463     5.919    11.223
====== GET ======
  10000 requests completed in 4.20 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.855 milliseconds (cumulative count 1)
50.000% <= 4.191 milliseconds (cumulative count 5011)
75.000% <= 4.799 milliseconds (cumulative count 7509)
87.500% <= 5.215 milliseconds (cumulative count 8755)
93.750% <= 5.487 milliseconds (cumulative count 9382)
96.875% <= 5.775 milliseconds (cumulative count 9692)
98.438% <= 6.039 milliseconds (cumulative count 9844)
99.219% <= 6.295 milliseconds (cumulative count 9922)
99.609% <= 6.639 milliseconds (cumulative count 9962)
99.805% <= 6.951 milliseconds (cumulative count 9981)
99.902% <= 10.151 milliseconds (cumulative count 9998)
99.988% <= 10.159 milliseconds (cumulative count 10000)
100.000% <= 10.159 milliseconds (cumulative count 10000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.030% <= 0.903 milliseconds (cumulative count 3)
0.050% <= 1.103 milliseconds (cumulative count 5)
0.100% <= 1.207 milliseconds (cumulative count 10)
0.120% <= 1.303 milliseconds (cumulative count 12)
0.190% <= 1.407 milliseconds (cumulative count 19)
0.250% <= 1.503 milliseconds (cumulative count 25)
0.320% <= 1.607 milliseconds (cumulative count 32)
0.390% <= 1.703 milliseconds (cumulative count 39)
0.540% <= 1.807 milliseconds (cumulative count 54)
0.790% <= 1.903 milliseconds (cumulative count 79)
1.040% <= 2.007 milliseconds (cumulative count 104)
1.320% <= 2.103 milliseconds (cumulative count 132)
13.140% <= 3.103 milliseconds (cumulative count 1314)
45.370% <= 4.103 milliseconds (cumulative count 4537)
84.490% <= 5.103 milliseconds (cumulative count 8449)
98.660% <= 6.103 milliseconds (cumulative count 9866)
99.810% <= 7.103 milliseconds (cumulative count 9981)
99.840% <= 8.103 milliseconds (cumulative count 9984)
99.860% <= 9.103 milliseconds (cumulative count 9986)
99.900% <= 10.103 milliseconds (cumulative count 9990)
100.000% <= 11.103 milliseconds (cumulative count 10000)

Summary:
  throughput summary: 2382.09 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        4.167     0.848     4.191     5.615     6.231    10.159